In [1]:
#import dependencies
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

#paths to load csv files
VIO_Data_1= pd.read_csv("Resources/VIO_Data_1_Final.csv")
VIO_Data_2= pd.read_csv("Resources/VIO_Data_2_Final.csv")
VIO_US_Data = pd.read_csv("Resources/VIO_US_Data.csv")
ACES_Data = pd.read_csv("Resources/ACES_Data.csv")
Parts_Data = pd.read_csv("Resources/Parts_Data.csv")

#merge the data into a single data set
VIO_Data_Complete = pd.merge(VIO_Data_1, VIO_Data_2, how="outer")
print(f'The length of VIO Data 1 is: {len(VIO_Data_1)} rows.')
print(f'The length of VIO Data 2 is: {len(VIO_Data_2)} rows.')
print(f'The length of merged VIO Data is: {len(VIO_Data_Complete)} rows.')

The length of VIO Data 1 is: 114382 rows.
The length of VIO Data 2 is: 155815 rows.
The length of merged VIO Data is: 270197 rows.

In [2]:
#print out the first 5 rows of the data set
VIO_Data_Complete.head()

   VehicleID          State  Year        Make   VIO
0        545      Wisconsin  1993  Land Rover   2.0
1        545        Montana  1993  Land Rover   9.0
2        545  New Hampshire  1993  Land Rover   6.0
3        545        Wyoming  1993  Land Rover   2.0
4        545        Florida  1993  Land Rover  14.0

In [3]:
#display counts of rows by column to determine if we need to drop any missing values
VIO_Data_Complete.count()

VehicleID    270197
State        268231
Year         270197
Make         270197
VIO          268231
dtype: int64

In [4]:
#we found that there were blank rows in the State and VIO columns, so we are dropping all blanks
VIO_Data_Clean = VIO_Data_Complete.dropna(how="any")

#verify that the counts are now correct
VIO_Data_Clean.count()

VehicleID    268231
State        268231
Year         268231
Make         268231
VIO          268231
dtype: int64

In [5]:
#check data types of the VIO data set
VIO_Data_Complete.dtypes

VehicleID      int64
State         object
Year           int64
Make          object
VIO          float64
dtype: object

In [6]:
#add age of cars column
VIO_Data_Complete['Age'] = 2019 - VIO_Data_Complete['Year']
VIO_Data_Complete.head()

   VehicleID          State  Year        Make   VIO  Age
0        545      Wisconsin  1993  Land Rover   2.0   26
1        545        Montana  1993  Land Rover   9.0   26
2        545  New Hampshire  1993  Land Rover   6.0   26
3        545        Wyoming  1993  Land Rover   2.0   26
4        545        Florida  1993  Land Rover  14.0   26

In [7]:
#output clean VIO data to a CSV file
VIO_Data_Complete.to_csv("Output/VIO_Complete.csv", index=False, header=True)

In [77]:
#print out the first five lines of the ACES data set
ACES_Data.head()

  ShortPartNumber  VehicleID
0    000000000884    15200.0
1  20388002239040    15200.0
2      0375456528    15200.0
3       228613009    15200.0
4    000010128564    15200.0

In [9]:
#check data types in ACES dataset
ACES_Data.dtypes

ShortPartNumber     object
VehicleID          float64
dtype: object

In [10]:
#display counts of rows by column to determine if we need to drop any missing values
ACES_Data.count()

ShortPartNumber    2192930
VehicleID          2191708
dtype: int64

In [11]:
#we found that there were blank rows in the VehicleID column, so we are dropping all blanks
ACES_Data_Clean = ACES_Data.dropna(how="any")

#verify that the counts are now correct
ACES_Data_Clean.count()

ShortPartNumber    2191708
VehicleID          2191708
dtype: int64

In [20]:
#Vehicle ID should be int, not float
ACES_Data_Clean['VehicleID'] = ACES_Data_Clean['VehicleID'].astype(int)
#ACES_Data_Clean_1.dtypes
ACES_Data_Clean.dtypes

/anaconda3/envs/PythonData2/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

ShortPartNumber    object
VehicleID           int64
dtype: object

In [13]:
#check data types of the ACES data set
ACES_Data.dtypes

ShortPartNumber     object
VehicleID          float64
dtype: object

In [22]:
#print out the first five lines of the Parts data set
Parts_Data.head()

  ShortPartNumber Main Category   Part Type Name  QTY
0        30758260        Engine  Timing Belt Kit   41
1         TB234K1        Engine  Timing Belt Kit   14
2       159321100        Engine  Timing Belt Kit   10
3         TB131K1        Engine  Timing Belt Kit  433
4         TB032K1        Engine  Timing Belt Kit   47

In [15]:
#display counts of rows by column to determine if we need to drop any missing values
Parts_Data.count()

ShortPartNumber    44620
Main Category      44602
Part Type Name     44608
QTY                44620
dtype: int64

In [29]:
#we found that there were blank rows in several columns, so we are dropping all blanks
Parts_Data_Clean = Parts_Data.dropna(how="any")

#verify that the counts are now correct
Parts_Data_Clean.count()

ShortPartNumber    44602
Main Category      44602
Part Type Name     44602
QTY                44602
dtype: int64

In [17]:
#check data types of the Parts data set
Parts_Data.dtypes

ShortPartNumber    object
Main Category      object
Part Type Name     object
QTY                 int64
dtype: object

In [105]:
merge_on_partNumber = pd.DataFrame.merge(Parts_Data_Clean, ACES_Data_Clean, how='inner', on='ShortPartNumber')
merge_on_partNumber.head()

  ShortPartNumber Main Category   Part Type Name  QTY  VehicleID
0        30758260        Engine  Timing Belt Kit   41       1510
1        30758260        Engine  Timing Belt Kit   41       1506
2        30758260        Engine  Timing Belt Kit   41       1511
3        30758260        Engine  Timing Belt Kit   41       1513
4        30758260        Engine  Timing Belt Kit   41       1507

In [114]:
#make smaller dataframe from VIO_Data_Complete
VIO_Data_Clean_columns = VIO_Data_Clean[['VehicleID','Make', 'VIO']]

#groupby VehicleID and sum the VIO
VIO_Data_Clean_Sum_VIO = VIO_Data_Clean_columns.groupby(['VehicleID', 'Make'])['VIO'].sum()

#convert to a datafame from a series to be able to merge back to table
Sum_VIO_df = pd.DataFrame(VIO_Data_Clean_Sum_VIO)
Sum_VIO_df.head()
reset_index_df = Sum_VIO_df.reset_index()

#final merge to add VIO sum to merge_on_partNumber dataframe
final_merged_dataframe = pd.DataFrame.merge(merge_on_partNumber, reset, how='left', on='VehicleID')
final_merged_dataframe.head()

,ShortPartNumber,Main Category,Part Type Name,QTY,VehicleID,Make,VIO
0,30758260,Engine,Timing Belt Kit,41,1510,Volvo,1727.0
1,30758260,Engine,Timing Belt Kit,41,1506,Volvo,1855.0
2,30758260,Engine,Timing Belt Kit,41,1511,Volvo,1136.0
3,30758260,Engine,Timing Belt Kit,41,1513,Volvo,1222.0
4,30758260,Engine,Timing Belt Kit,41,1507,Volvo,2946.0